In [1]:
import numpy as np
import pandas as pd

In [2]:
item_df = pd.read_csv('../data/tianchi_fresh_comp_train_item.csv')
user_df = pd.read_csv('../data/tianchi_fresh_comp_train_user.csv')

In [3]:
user_df.head()

,user_id,item_id,behavior_type,user_geohash,item_category,time
0,10001082,285259775,1,97lk14c,4076,2014-12-08 18
1,10001082,4368907,1,NaN,5503,2014-12-12 12
2,10001082,4368907,1,NaN,5503,2014-12-12 12
3,10001082,53616768,1,NaN,9762,2014-12-02 15
4,10001082,151466952,1,NaN,5232,2014-12-12 11

In [4]:
item_df.head()

     item_id item_geohash  item_category
0  100002303          NaN           3368
1  100003592          NaN           7995
2  100006838          NaN          12630
3  100008089          NaN           7791
4  100012750          NaN           9614

In [5]:
item_df.shape

(620918, 3)

In [6]:
user_df['user_geohash'].isnull().value_counts()

True     15911010
False     7380017
Name: user_geohash, dtype: int64

In [7]:
item_df['item_geohash'].isnull().value_counts()

True     417508
False    203410
Name: item_geohash, dtype: int64

In [8]:
user_df = user_df.drop('user_geohash', axis=1)
item_df = item_df.drop('item_geohash', axis=1)

In [9]:
user_df['time_day'] = user_df.time.apply(lambda x: x.split(' ')[0])
user_df.head()

,user_id,item_id,behavior_type,item_category,time,time_day
0,10001082,285259775,1,4076,2014-12-08 18,2014-12-08
1,10001082,4368907,1,5503,2014-12-12 12,2014-12-12
2,10001082,4368907,1,5503,2014-12-12 12,2014-12-12
3,10001082,53616768,1,9762,2014-12-02 15,2014-12-02
4,10001082,151466952,1,5232,2014-12-12 11,2014-12-12

In [10]:
user_df = user_df.drop('time', axis=1)
user_df.head()

    user_id    item_id  behavior_type  item_category    time_day
0  10001082  285259775              1           4076  2014-12-08
1  10001082    4368907              1           5503  2014-12-12
2  10001082    4368907              1           5503  2014-12-12
3  10001082   53616768              1           9762  2014-12-02
4  10001082  151466952              1           5232  2014-12-12

In [11]:
data1 = user_df[(user_df.time_day=='2014-12-15')|(user_df.time_day=='2014-12-16')][['user_id', 'item_id', 'behavior_type']]
data1.head()

      user_id    item_id  behavior_type
12   10001082  150720867              1
23   10001082   22667958              1
31   10001082  133020432              1
58   10001082  377161387              1
128  10001082  275221686              1

In [12]:
data1.shape

(1515455, 3)

In [13]:
behavior_type1 = pd.get_dummies(data1['behavior_type'], prefix='behavior_type')
behavior_type1.head()

     behavior_type_1  behavior_type_2  behavior_type_3  behavior_type_4
12                 1                0                0                0
23                 1                0                0                0
31                 1                0                0                0
58                 1                0                0                0
128                1                0                0                0

In [14]:
data1_dummy = pd.concat([data1, behavior_type1], axis=1)
data1_dummy.head()

,user_id,item_id,behavior_type,behavior_type_1,behavior_type_2,behavior_type_3,behavior_type_4
12,10001082,150720867,1,1,0,0,0
23,10001082,22667958,1,1,0,0,0
31,10001082,133020432,1,1,0,0,0
58,10001082,377161387,1,1,0,0,0
128,10001082,275221686,1,1,0,0,0

In [15]:
data1_dummy = data1_dummy.drop('behavior_type', axis=1)
data1_dummy.head()

,user_id,item_id,behavior_type_1,behavior_type_2,behavior_type_3,behavior_type_4
12,10001082,150720867,1,0,0,0
23,10001082,22667958,1,0,0,0
31,10001082,133020432,1,0,0,0
58,10001082,377161387,1,0,0,0
128,10001082,275221686,1,0,0,0

In [16]:
data1_dummy = data1_dummy.groupby(['user_id', 'item_id']).agg('sum').reset_index()
data1_dummy.head()

,user_id,item_id,behavior_type_1,behavior_type_2,behavior_type_3,behavior_type_4
0,492,31040941,2,0,0,0
1,3726,2091858,1,0,0,0
2,3726,32998064,2,0,0,0
3,3726,34902851,1,0,0,0
4,3726,54088634,2,0,0,0

In [17]:
data1_dummy.shape

(639277, 6)

In [18]:
data2 = user_df[user_df.time_day=='2014-12-17'][['user_id', 'item_id', 'behavior_type']]
data2.head()

       user_id    item_id  behavior_type
35    10001082  275221686              1
43    10001082     582649              1
125   10001082  275221686              1
176   10001082  188586750              1
221  100029775   61251128              1

In [19]:
data2.shape

(734520, 3)

In [20]:
behavior_type2 = pd.get_dummies(data2['behavior_type'], prefix='behavior_type')
behavior_type2.head()

     behavior_type_1  behavior_type_2  behavior_type_3  behavior_type_4
35                 1                0                0                0
43                 1                0                0                0
125                1                0                0                0
176                1                0                0                0
221                1                0                0                0

In [21]:
data2_dummy = pd.concat([data2, behavior_type2], axis=1)
data2_dummy.head()

,user_id,item_id,behavior_type,behavior_type_1,behavior_type_2,behavior_type_3,behavior_type_4
35,10001082,275221686,1,1,0,0,0
43,10001082,582649,1,1,0,0,0
125,10001082,275221686,1,1,0,0,0
176,10001082,188586750,1,1,0,0,0
221,100029775,61251128,1,1,0,0,0

In [22]:
data2_dummy = data2_dummy.drop('behavior_type', axis=1)
data2_dummy.head()

,user_id,item_id,behavior_type_1,behavior_type_2,behavior_type_3,behavior_type_4
35,10001082,275221686,1,0,0,0
43,10001082,582649,1,0,0,0
125,10001082,275221686,1,0,0,0
176,10001082,188586750,1,0,0,0
221,100029775,61251128,1,0,0,0

In [23]:
data2_dummy = data2_dummy.groupby(['user_id', 'item_id']).agg('sum').reset_index()

In [24]:
data2_dummy.shape

(316132, 6)

In [28]:
data2_dummy['behavior_type_4'].value_counts()

0     309963
1       5605
2        389
3         96
4         44
5         13
6         11
7          4
10         2
9          2
8          2
11         1
Name: behavior_type_4, dtype: int64

In [25]:
data3 = pd.merge(data1_dummy, data2_dummy[['user_id', 'item_id', 'behavior_type_4']], on=['user_id', 'item_id'], how='left').fillna(0)
data3.head()

,user_id,item_id,behavior_type_1,behavior_type_2,behavior_type_3,behavior_type_4_x,behavior_type_4_y
0,492,31040941,2,0,0,0,0.0
1,3726,2091858,1,0,0,0,0.0
2,3726,32998064,2,0,0,0,0.0
3,3726,34902851,1,0,0,0,0.0
4,3726,54088634,2,0,0,0,0.0

In [26]:
data3.shape

(639277, 7)

In [30]:
data4 = user_df[(user_df.time_day=='2014-12-16')|(user_df.time_day=='2014-12-17')][['user_id', 'item_id', 'behavior_type']]
data4.head()

       user_id    item_id  behavior_type
35    10001082  275221686              1
43    10001082     582649              1
125   10001082  275221686              1
176   10001082  188586750              1
221  100029775   61251128              1

In [31]:
data4.shape

(1485890, 3)

In [32]:
behavior_type4 = pd.get_dummies(data4['behavior_type'], prefix='behavior_type')
behavior_type4.head()

     behavior_type_1  behavior_type_2  behavior_type_3  behavior_type_4
35                 1                0                0                0
43                 1                0                0                0
125                1                0                0                0
176                1                0                0                0
221                1                0                0                0

In [33]:
data4_dummy = pd.concat([data4, behavior_type4], axis=1)
data4_dummy.head()

,user_id,item_id,behavior_type,behavior_type_1,behavior_type_2,behavior_type_3,behavior_type_4
35,10001082,275221686,1,1,0,0,0
43,10001082,582649,1,1,0,0,0
125,10001082,275221686,1,1,0,0,0
176,10001082,188586750,1,1,0,0,0
221,100029775,61251128,1,1,0,0,0

In [34]:
data4_dummy = data4_dummy.drop('behavior_type', axis=1)
data4_dummy.head()

,user_id,item_id,behavior_type_1,behavior_type_2,behavior_type_3,behavior_type_4
35,10001082,275221686,1,0,0,0
43,10001082,582649,1,0,0,0
125,10001082,275221686,1,0,0,0
176,10001082,188586750,1,0,0,0
221,100029775,61251128,1,0,0,0

In [35]:
data4_dummy = data4_dummy.groupby(['user_id', 'item_id']).agg('sum').reset_index()
data4_dummy.head()

,user_id,item_id,behavior_type_1,behavior_type_2,behavior_type_3,behavior_type_4
0,492,333812946,4,0,0,0
1,3726,37476258,1,0,0,0
2,3726,54088634,2,0,0,0
3,3726,64607517,2,0,0,0
4,3726,73091924,2,0,0,0

In [36]:
data4_dummy.shape

(625708, 6)

In [37]:
data5 = user_df[user_df.time_day=='2014-12-18'][['user_id', 'item_id', 'behavior_type']]
data5.head()

       user_id    item_id  behavior_type
217  100029775  247380548              1
232  100029775  247380548              2
250  100029775  205264014              1
274  100029775  205264014              1
317  100029775   87557153              1

In [38]:
data5.shape

(711839, 3)

In [39]:
behavior_type5 = pd.get_dummies(data5['behavior_type'], prefix='behavior_type')
behavior_type5.head()

     behavior_type_1  behavior_type_2  behavior_type_3  behavior_type_4
217                1                0                0                0
232                0                1                0                0
250                1                0                0                0
274                1                0                0                0
317                1                0                0                0

In [40]:
data5_dummy = pd.concat([data5, behavior_type5], axis=1)
data5_dummy.head()

,user_id,item_id,behavior_type,behavior_type_1,behavior_type_2,behavior_type_3,behavior_type_4
217,100029775,247380548,1,1,0,0,0
232,100029775,247380548,2,0,1,0,0
250,100029775,205264014,1,1,0,0,0
274,100029775,205264014,1,1,0,0,0
317,100029775,87557153,1,1,0,0,0

In [41]:
data5_dummy = data5_dummy.drop('behavior_type', axis=1)
data5_dummy.head()

,user_id,item_id,behavior_type_1,behavior_type_2,behavior_type_3,behavior_type_4
217,100029775,247380548,1,0,0,0
232,100029775,247380548,0,1,0,0
250,100029775,205264014,1,0,0,0
274,100029775,205264014,1,0,0,0
317,100029775,87557153,1,0,0,0

In [42]:
data5_dummy = data5_dummy.groupby(['user_id', 'item_id']).agg('sum').reset_index()

In [43]:
data5_dummy.head()

,user_id,item_id,behavior_type_1,behavior_type_2,behavior_type_3,behavior_type_4
0,492,68197904,3,0,0,0
1,492,169720786,2,0,0,0
2,492,262056903,3,0,0,0
3,492,319959973,2,0,0,0
4,3726,2742779,2,0,0,0

In [44]:
data5_dummy.shape

(307137, 6)

In [45]:
data6 = pd.merge(data4_dummy, data5_dummy[['user_id', 'item_id', 'behavior_type_4']], on=['user_id', 'item_id'], how='left').fillna(0)
data6.head()

,user_id,item_id,behavior_type_1,behavior_type_2,behavior_type_3,behavior_type_4_x,behavior_type_4_y
0,492,333812946,4,0,0,0,0.0
1,3726,37476258,1,0,0,0,0.0
2,3726,54088634,2,0,0,0,0.0
3,3726,64607517,2,0,0,0,0.0
4,3726,73091924,2,0,0,0,0.0

In [46]:
data6.shape

(625708, 7)

In [47]:
data7 = user_df[(user_df.time_day=='2014-12-17')|(user_df.time_day=='2014-12-18')][['user_id', 'item_id', 'behavior_type']]
data7.head()

       user_id    item_id  behavior_type
35    10001082  275221686              1
43    10001082     582649              1
125   10001082  275221686              1
176   10001082  188586750              1
217  100029775  247380548              1

In [48]:
behavior_type7 = pd.get_dummies(data7['behavior_type'], prefix='behavior_type')
behavior_type7.head()

     behavior_type_1  behavior_type_2  behavior_type_3  behavior_type_4
35                 1                0                0                0
43                 1                0                0                0
125                1                0                0                0
176                1                0                0                0
217                1                0                0                0

In [49]:
data7_dummy = pd.concat([data7, behavior_type7], axis=1)
data7_dummy.head()

,user_id,item_id,behavior_type,behavior_type_1,behavior_type_2,behavior_type_3,behavior_type_4
35,10001082,275221686,1,1,0,0,0
43,10001082,582649,1,1,0,0,0
125,10001082,275221686,1,1,0,0,0
176,10001082,188586750,1,1,0,0,0
217,100029775,247380548,1,1,0,0,0

In [50]:
data7_dummy = data7_dummy.drop('behavior_type', axis=1)
data7_dummy.head()

,user_id,item_id,behavior_type_1,behavior_type_2,behavior_type_3,behavior_type_4
35,10001082,275221686,1,0,0,0
43,10001082,582649,1,0,0,0
125,10001082,275221686,1,0,0,0
176,10001082,188586750,1,0,0,0
217,100029775,247380548,1,0,0,0

In [51]:
data7_dummy.shape

(1446359, 6)

In [52]:
data7_dummy = data7_dummy.groupby(['user_id', 'item_id']).agg('sum').reset_index()
data7_dummy.head()

,user_id,item_id,behavior_type_1,behavior_type_2,behavior_type_3,behavior_type_4
0,492,68197904,3,0,0,0
1,492,169720786,2,0,0,0
2,492,262056903,3,0,0,0
3,492,319959973,2,0,0,0
4,492,333812946,4,0,0,0

In [53]:
data7_dummy.shape

(609641, 6)

In [54]:
data3['label'] = data3['behavior_type_4_y'].apply(lambda x: 1 if x>0 else 0)
data3.head()

,user_id,item_id,behavior_type_1,behavior_type_2,behavior_type_3,behavior_type_4_x,behavior_type_4_y,label
0,492,31040941,2,0,0,0,0.0,0
1,3726,2091858,1,0,0,0,0.0,0
2,3726,32998064,2,0,0,0,0.0,0
3,3726,34902851,1,0,0,0,0.0,0
4,3726,54088634,2,0,0,0,0.0,0

In [55]:
data3['label'].value_counts()

0    637962
1      1315
Name: label, dtype: int64

In [80]:
# 相关性
corrDf = data3[['behavior_type_1', 'behavior_type_2', 'behavior_type_3', 'behavior_type_4_x', 'label']].corr()
corrDf

,behavior_type_1,behavior_type_2,behavior_type_3,behavior_type_4_x,label
behavior_type_1,1.000000,0.147999,0.291671,0.279009,0.067271
behavior_type_2,0.147999,1.000000,-0.000051,0.020494,0.017130
behavior_type_3,0.291671,-0.000051,1.000000,0.285381,0.095185
behavior_type_4_x,0.279009,0.020494,0.285381,1.000000,0.008693
label,0.067271,0.017130,0.095185,0.008693,1.000000

In [56]:
data6['label'] = data6['behavior_type_4_y'].apply(lambda x: 1 if x>0 else 0)
data6.head()

,user_id,item_id,behavior_type_1,behavior_type_2,behavior_type_3,behavior_type_4_x,behavior_type_4_y,label
0,492,333812946,4,0,0,0,0.0,0
1,3726,37476258,1,0,0,0,0.0,0
2,3726,54088634,2,0,0,0,0.0,0
3,3726,64607517,2,0,0,0,0.0,0
4,3726,73091924,2,0,0,0,0.0,0

In [57]:
data6['label'].value_counts()

0    624442
1      1266
Name: label, dtype: int64

In [58]:
x_train = data3.iloc[:, 2:6]
y_train = data3.iloc[:, -1]

In [59]:
x_test = data6.iloc[:, 2:6]
y_test = data6.iloc[:, -1]

In [60]:
x_pred = data7_dummy.iloc[:, 2:]

In [61]:
from imblearn.over_sampling import SMOTE
from collections import Counter

In [62]:
over_sample = SMOTE()
x_train_over_sample, y_train_over_sample = over_sample.fit_sample(x_train, y_train)

In [63]:
Counter(y_train_over_sample)

Counter({0: 637962, 1: 637962})

## Logistic Regression

In [64]:
from sklearn.linear_model import LogisticRegression
from sklearn.model_selection import cross_val_score

In [65]:
clf = LogisticRegression(class_weight='balanced')
clf.fit(x_train, y_train)

precision = np.mean(cross_val_score(clf, x_train, y_train, cv=10, scoring='precision'))
recall = np.mean(cross_val_score(clf, x_train, y_train, cv=10, scoring='recall'))
F1 = np.mean(cross_val_score(clf, x_train, y_train, cv=10, scoring='f1'))

print precision
print recall
print F1

0.0134515050078
0.707205644229
0.0264005062794

In [66]:
from sklearn import metrics

In [67]:
y_pred = clf.predict(x_test)

print metrics.precision_score(y_test, y_pred)
print metrics.recall_score(y_test, y_pred)
print metrics.f1_score(y_test, y_pred)

0.0130553676968
0.701421800948
0.0256336239247

## naive bayes

In [68]:
from sklearn.naive_bayes import GaussianNB

In [69]:
clf = GaussianNB()

precision = np.mean(cross_val_score(clf, x_train, y_train, cv=10, scoring='precision'))
recall = np.mean(cross_val_score(clf, x_train, y_train, cv=10, scoring='recall'))
F1 = np.mean(cross_val_score(clf, x_train, y_train, cv=10, scoring='f1'))

print precision
print recall
print F1

0.0167184452022
0.287416146195
0.0315974557084

In [70]:
clf.fit(x_train, y_train)
y_pred = clf.predict(x_test)

print metrics.precision_score(y_test, y_pred)
print metrics.recall_score(y_test, y_pred)
print metrics.f1_score(y_test, y_pred)

0.0150796491856
0.266192733017
0.0285423901076

In [71]:
predict = clf.predict(x_pred)
data7_dummy['label'] = predict
submission = data7_dummy[data7_dummy['label']==1][['user_id', 'item_id']]
submission.head()

     user_id    item_id
17      3726  238805428
27     38745    7156711
75     45561   18086124
130    45561  195041142
142    45561  214916679

In [72]:
submission.to_csv('tianchi_mobile_recommendation_predict.csv', index=False)

In [188]:
submission.shape

(21630, 2)

In [189]:
data2[data2['behavior_type']==4].shape

(7071, 3)

In [190]:
data5[data5['behavior_type']==4].shape

(6925, 3)

## Bagging

In [73]:
from sklearn.ensemble import BaggingClassifier

In [78]:
clf = BaggingClassifier(base_estimator=LogisticRegression(class_weight='balanced'), n_estimators=100)

precision = np.mean(cross_val_score(clf, x_train, y_train, cv=10, scoring='precision'))
recall = np.mean(cross_val_score(clf, x_train, y_train, cv=10, scoring='recall'))
F1 = np.mean(cross_val_score(clf, x_train, y_train, cv=10, scoring='f1'))

print precision
print recall
print F1

0.0134713965915
0.707205644229
0.0264158534185

In [81]:
clf.fit(x_train, y_train)
y_pred = clf.predict(x_test)

print metrics.precision_score(y_test, y_pred)
print metrics.recall_score(y_test, y_pred)
print metrics.f1_score(y_test, y_pred)

0.0130561355015
0.701421800948
0.0256351039261

## Boosting

### 1. Adaboost

In [79]:
from sklearn.ensemble import AdaBoostClassifier

In [82]:
base= LogisticRegression()
clf = AdaBoostClassifier(n_estimators=100, base_estimator=base)

precision = np.mean(cross_val_score(clf, x_train, y_train, cv=10, scoring='precision'))
recall= np.mean(cross_val_score(clf, x_train, y_train, cv=10, scoring='recall'))
F1 = np.mean(cross_val_score(clf, x_train, y_train, cv=10, scoring='f1'))

print precision
print recall
print F1

0.0353492145396
0.00532037936618
0.00920233598376

In [83]:
clf.fit(x_train, y_train)
y_pred = clf.predict(x_test)

print metrics.precision_score(y_test, y_pred)
print metrics.recall_score(y_test, y_pred)
print metrics.f1_score(y_test, y_pred)

0.0401785714286
0.00710900473934
0.0120805369128

### 2. GBM

In [85]:
from sklearn.ensemble import GradientBoostingClassifier

In [88]:
clf = GradientBoostingClassifier(random_state=10)

precision = np.mean(cross_val_score(clf, x_train, y_train, cv=5, scoring='precision'))
recall= np.mean(cross_val_score(clf, x_train, y_train, cv=5, scoring='recall'))
F1 = np.mean(cross_val_score(clf, x_train, y_train, cv=5, scoring='f1'))

print precision
print recall
print F1

0.0
0.0
0.0